Revit 2026 API

# WorksetDefaultVisibilitySettingsSetWorksetVisibility Method

---

Set the default visibility of a workset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetWorksetVisibility(
	WorksetId worksetId,
	bool visible
)
```
```vb
Public Sub SetWorksetVisibility (
	worksetId As WorksetId,
	visible As Boolean
)
```
```cpp
public:
void SetWorksetVisibility(
	WorksetId^ worksetId,
	bool visible
)
```
```fsharp
member SetWorksetVisibility :
        worksetId : WorksetId *
        visible : bool -> unit
```

#### Parameters

worksetId WorksetId
     Id of the workset.
visible Boolean
     Whether the workset should be visible by default or not.

| Exception | Condition |
| --- | --- |
| ArgumentException | There is no workset with this Id in the document. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | WorksetDefaultVisibilitySettings is not applicable to family documents. |

#### Reference

WorksetDefaultVisibilitySettings Class

Autodesk.Revit.DB Namespace